#SQL

##Task 1
Query all columns for a city in CITY with the ID 1661.

Input Format

The CITY table is described as follows: <br>
<img src = "https://s3.amazonaws.com/hr-challenge-images/8137/1449729804-f21d187d0f-CITY.jpg">

1.   List item
2.   List item

In [ ]:
pd.read_sql_query('SELECT * FROM CITY WHERE ID == 1661', conn)

##Task 2
Query all columns for all American cities in CITY with populations larger than 100000. The CountryCode for America is USA.

Input Format<br>
<img src = "https://s3.amazonaws.com/hr-challenge-images/8137/1449729804-f21d187d0f-CITY.jpg">

In [ ]:
pd.read_sql_query('SELECT * FROM CITY WHERE COUNTRYCODE LIKE "USA" AND POPULATION > 100000', conn)

##Task 3
Query all attributes of every Japanese city in the CITY table. The COUNTRYCODE for Japan is JPN.

Input Format:<br>
<img src = "https://s3.amazonaws.com/hr-challenge-images/8137/1449729804-f21d187d0f-CITY.jpg">

In [ ]:
pd.read_sql_query('SELECT * FROM CITY WHERE COUNTRYCODE LIKE "JPN"', conn)

##Task 4
Query the names of all the Japanese cities in the CITY table. The COUNTRYCODE for Japan is JPN.

Input Format<br>
<img src = "https://s3.amazonaws.com/hr-challenge-images/8137/1449729804-f21d187d0f-CITY.jpg">

In [ ]:
pd.read_sql_query('SELECT NAME FROM CITY WHERE COUNTRYCODE LIKE "JPN"', conn)

##Task 5
Query a list of CITY and STATE from the STATION table.

Input Format

The STATION table is described as follows:<br>
<img src = 'https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg'>

In [ ]:
pd.read_sql_query('SELECT CITY, STATE FROM STATION', conn)

##Task 6
Query a list of CITY names from STATION with even ID numbers only. You may print the results in any order, but must exclude duplicates from your answer.

Input Format

The STATION table is described as follows:<br>
<img src ="https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg">

In [ ]:
pd.read_sql_query('SELECT DISTINCT CITY FROM STATION WHERE ID % 2 == 0', conn)

Let  be the number of CITY entries in STATION, and let  be the number of distinct CITY names in STATION; query the value of  from STATION. In other words, find the difference between the total number of CITY entries in the table and the number of distinct CITY entries in the table.

Input Format

The STATION table is described as follows:<br>
<img src = "https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg"><br>
where LAT_N is the northern latitude and LONG_W is the western longitude.

In [ ]:
city_entries = pd.read_sql_query('SELECT CITY FROM STATION', conn)
distinct_city_entries = pd.read_sql_query('SELECT DISTINCT CITY FROM STATION', conn)
diff = city_entries.count()[0] - distinct_city_entries.count()[0]

##Task 7
Query the two cities in STATION with the shortest and longest CITY names, as well as their respective lengths (i.e.: number of characters in the name). If there is more than one smallest or largest city, choose the one that comes first when ordered alphabetically.

Input Format

The STATION table is described as follows:<br>
  <img src = "https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg">

In [ ]:
smallest = pd.read_sql_query('SELECT CITY FROM STATION ORDER BY length(CITY), CITY LIMIT 1', conn)
largest = pd.read_sql_query('SELECT CITY FROM STATION ORDER BY length(CITY) DESC, CITY LIMIT 1', conn)
pd.concat([smallest, largest])

##Task 8
Query the list of CITY names starting with vowels (i.e., a, e, i, o, or u) from STATION. Your result cannot contain duplicates.

Input Format

The STATION table is described as follows: <br>
<img src = "https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg" >

In [ ]:
pd.read_sql_query('''
SELECT DISTINCT CITY 
FROM STATION 
WHERE 
    lower(substr(CITY, 1, 1)) IN ("a","e", "i", "o", "u")
''', conn)

##Task 9
Query the list of CITY names ending with vowels (a, e, i, o, u) from STATION. Your result cannot contain duplicates.

Input Format

The STATION table is described as follows:<br>
<img src ="https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg">

In [ ]:
pd.read_sql_query('''
SELECT DISTINCT CITY 
FROM STATION 
WHERE lower(substr(CITY, -1, 1)) IN ("a", "e", "i", "o", "u")
''', conn)

##Task 10
Query the list of CITY names from STATION which have vowels (i.e., a, e, i, o, and u) as both their first and last characters. Your result cannot contain duplicates.

Input Format

The STATION table is described as follows:<br>
<img src ="https://s3.amazonaws.com/hr-challenge-images/9336/1449345840-5f0a551030-Station.jpg">

In [ ]:
pd.read_sql_query('''
SELECT DISTINCT CITY 
FROM STATION 
WHERE 
    lower(substr(CITY, -1, 1)) IN ("a","e", "i", "o", "u")
    AND lower(substr(CITY, 1, 1)) IN ("a","e", "i", "o", "u")
''', conn)

#Python

##Task 1
Task
Given an integer, perform the following conditional actions:

* If n is odd, print `Weird`
* If n is even and in the inclusive range of 2 to 5, print `Not Weird`
* If n is even and in the inclusive range of 6 to 20, print `Weird`
* If n is even and greater than 20, print `Not Weird`

Input Format

A single line containing a positive integer

Output Format

Print Weird if the number is weird; otherwise, print Not Weird.

In [ ]:
if __name__ == '__main__':
    n = int(input())
    # your code here
    if n % 2 != 0:
        print('Weird')
    else:
        if n >= 2 and n <= 5: print('Not Weird')
        elif n >= 6 and n <= 20: print('Weird')
        elif n > 20: print('Not Weird')

12
Weird

##Task 2
Read two integers from STDIN and print three lines where:
<ol>
  <li>The first line contains the sum of the two numbers.</li>
  <li>The second line contains the difference of the two numbers (first - second).</li>
  <li>The third line contains the product of the two numbers.</li>
</ol>

**Input Format**

The first line contains the first integer, **a**. The second line contains the second integer, **b**.

**Output Format**

Print the three lines as explained above.

In [ ]:
if __name__ == '__main__':
    a = int(input())
    b = int(input())
    # your code here
    print(a + b)
    print(a - b)
    print(a * b)

3
4
7
-1
12

#Task 3
Task
Read an integer $N$. For all non-negative integers $i<N$ , print $i^{2}$. See the sample for details.

Input Format

The first and only line contains the integer, $N$ .

Constraints<br>
$1 \leq N \leq i$

Output Format

Print $N$ lines, one corresponding to each $i$.

In [ ]:
if __name__ == '__main__':
    n = int(input())
    # your code here
    for i in range(n):
        print(i*i)

5
0
1
4
9
16

##Task 4
We add a Leap Day on February 29, almost every four years. The leap day is an extra, or intercalary day and we add it to the shortest month of the year, February.<br>

In the Gregorian calendar three criteria must be taken into account to identify leap years:
<ul>
<li>The year can be evenly divided by 4, is a leap year, unless:</li>
  <ul><li>The year can be evenly divided by 100, it is NOT a leap year, unless:</li>
    <ul><li>The year is also evenly divisible by 400. Then it is a leap year.</li></ul></ul></ul>
This means that in the Gregorian calendar, the years 2000 and 2400 are leap years, while 1800, 1900, 2100, 2200, 2300 and 2500 are NOT leap years.Source

**Task**<br>
<ul>
<li>You are given the year, and you have to write a function to check if the year is leap or not.</li>

  <li>Note that you have to complete the function and remaining code is given as template.</li>
  </ul>

**Input Format**

Read y, the year that needs to be checked.

**Constraints**<br>
$1900 \leq y \leq 10^{5}$

**Output Format**

Output is taken care of by the template. Your function must return a boolean value (True/False)

In [ ]:
def is_leap(year):
    if year % 4 != 0:
        return False
    if year % 100 == 0 and year % 400 != 0:
        return False
    return True 
# leap_years = [ 2000, 2004, 2008, 2012, 2016, 2020, 2024, 2028, 2032, 2036, 2040, 2044,2048]
# print([is_leap(year) for year in leap_years])
  
  # your code here

[True, True, True, True, True, True, True, True, True, True, True, True, True]

##Task 5
Given the participants' score sheet for your University Sports Day, you are required to find the runner-up score. You are given $n$ scores. Store them in a list and find the score of the runner-up.

**Input Format**

The first line contains $n$ . The second line contains an array $A[]$ of $n$ integers each separated by a space.

**Constraints**<br>
$2   \leq n \leq 10 $<br>
$-100 \leq A[i] \leq 100 $

Output Format

Print the runner-up score.

In [ ]:
if __name__ == '__main__':
    n = int(input())
    # your code here
    a = [int(num) for num in input().split(' ')]
    a.sort(reverse=True)
    print(a[1])

3
8 19 3
8

# Bonus

1. Python Lab

3.
This problem was asked by Snapchat.

Given a list of possibly overlapping intervals, return a new list of intervals where all overlapping intervals have been merged.

The input list is not necessarily ordered in any way.

For example, given [(1, 3), (5, 8), (4, 10), (20, 25)], you should return [(1, 3), (4, 10), (20, 25)].

In [ ]:
# Your code here
def merge_interval(a):
    a.sort()
    min_val = a[0][0]
    max_val = a[0][1]
    res = []
    for i in range(1, len(a)):
        if a[i][0] > max_val:
            res.append((min_val, max_val))
            min_val = a[i][0]
            max_val = a[i][1]
        else:
            max_val = max(a[i][1], max_val)
    res.append((min_val, max_val))
    print(res)
            
           
a =  [(1, 3), (5, 11), (4, 10), (20, 25)]
merge_interval(a)

[(1, 3), (4, 11), (20, 25)]


5.
You are given a string. The only operation allowed is to insert characters in the beginning of the string. How many minimum characters are needed to be inserted to make the string a palindrome string

Example: Input: ABC Output: 2 Input: AACECAAAA Output: 2

In [ ]:
# Your code here
def min_construct(s):
    res = 0
    longest_len = 0
    for i in range(1, len(s)):
        if s[:i+1] == s[:i+1][::-1]:
            longest_len = i + 1
    if longest_len > 0:
        res = len(s) - longest_len
    else:
        res = len(s) - 1
    return res

s = 'AACECAAAA'
print(min_construct(s))

2

2. SQL

In [ ]:
# Find all tracks that couldn't be sold (null invoice_items)
pd.read_sql_query('''
SELECT tracks.TrackId, tracks.Name
FROM tracks
LEFT JOIN invoice_items ON tracks.TrackId == invoice_items.TrackId
WHERE InvoiceId IS NULL
''', conn)

      TrackId                                               Name
0           7                                    Let's Get It Up
1          11                                             C.O.D.
2          17                                  Let There Be Rock
3          18                                     Bad Boy Boogie
4          22                                  Whole Lotta Rosie
...       ...                                                ...
1514     3497                                    Erlkonig, D.328
1515     3498  Concerto for Violin, Strings and Continuo in G...
1516     3501               L'orfeo, Act 3, Sinfonia (Orchestra)
1517     3502  Quintet for Horn, Violin, 2 Violas, and Cello ...
1518     3503                                      Koyaanisqatsi

[1519 rows x 2 columns]

In [ ]:
# List all genres and the distinct media types in each genre
pd.read_sql_query('''
SELECT genres.Name as Genre, media_types.Name AS Media_Type
FROM tracks
INNER JOIN genres ON tracks.GenreId == genres.GenreId             
INNER JOIN media_types ON media_types.MediaTypeId == tracks.MediaTypeId       
GROUP BY Genre, Media_Type

''', conn)

                 Genre                   Media_Type
0          Alternative     Protected AAC audio file
1          Alternative  Protected MPEG-4 video file
2          Alternative     Purchased AAC audio file
3   Alternative & Punk              MPEG audio file
4                Blues              MPEG audio file
5           Bossa Nova              MPEG audio file
6            Classical               AAC audio file
7            Classical     Protected AAC audio file
8            Classical     Purchased AAC audio file
9               Comedy  Protected MPEG-4 video file
10               Drama  Protected MPEG-4 video file
11      Easy Listening              MPEG audio file
12   Electronica/Dance               AAC audio file
13   Electronica/Dance              MPEG audio file
14         Heavy Metal              MPEG audio file
15         Hip Hop/Rap              MPEG audio file
16                Jazz               AAC audio file
17                Jazz              MPEG audio file
18               Latin               AAC audio file
19               Latin              MPEG audio file
20               Metal              MPEG audio file
21               Opera     Protected AAC audio file
22                 Pop              MPEG audio file
23                 Pop     Protected AAC audio file
24            R&B/Soul              MPEG audio file
25            R&B/Soul     Protected AAC audio file
26              Reggae              MPEG audio file
27                Rock               AAC audio file
28                Rock              MPEG audio file
29                Rock     Protected AAC audio file
30       Rock And Roll              MPEG audio file
31    Sci Fi & Fantasy  Protected MPEG-4 video file
32     Science Fiction  Protected MPEG-4 video file
33          Soundtrack              MPEG audio file
34          Soundtrack     Protected AAC audio file
35            TV Shows  Protected MPEG-4 video file
36               World               AAC audio file
37               World              MPEG audio file

In [ ]:
# Find the revenue of 2013
pd.read_sql_query('''
SELECT strftime('%Y',invoices.InvoiceDate) AS Year, SUM(invoice_items.UnitPrice * invoice_items.Quantity) as Revenue
FROM invoices
INNER JOIN invoice_items ON invoice_items.InvoiceId == invoices.InvoiceId
GROUP BY Year
HAVING Year LIKE '2013'
''', conn)

   Year  Revenue
0  2013   450.58

In [ ]:
# Find the number of tracks belong to the genre Rock
pd.read_sql_query('''
SELECT COUNT(tracks.Name) AS 'Number of Tracks'
FROM tracks
INNER JOIN genres ON tracks.GenreId == genres.GenreId
GROUP BY genres.Name
HAVING genres.Name LIKE 'Rock'
''', conn)

   Number of Tracks
0              1297

In [ ]:
# Find the number of customers each employee has supported
pd.read_sql_query('''
SELECT employees.LastName || ' ' || employees.FirstName AS Employee, COUNT(customers.CustomerId) AS 'No of customers'
FROM employees
INNER JOIN customers ON employees.EmployeeId == customers.SupportRepId
GROUP BY Employee
''', conn)

        Employee  No of customers
0  Johnson Steve               18
1  Park Margaret               20
2   Peacock Jane               21

In [ ]:
# Find the customer who paid the most
pd.read_sql_query('''
SELECT customers.FirstName || ' ' || customers.Lastname as Customer, SUM(invoice_items.UnitPrice * invoice_items.Quantity) as Paid
FROM customers
INNER JOIN invoices ON invoices.CustomerId == customers.CustomerId
INNER JOIN invoice_items ON invoice_items.InvoiceId == invoices.InvoiceId
GROUP BY customers.CustomerId
ORDER BY Paid DESC 
LIMIT 1
 ''', conn)

      Customer   Paid
0  Helena Holý  49.62

In [ ]:
# Find the richest artist
pd.read_sql_query('''
SELECT artists.Name, SUM(invoice_items.UnitPrice * invoice_items.Quantity) AS Revenue
FROM artists
INNER JOIN albums ON artists.ArtistId == albums.ArtistId
INNER JOIN tracks ON tracks.AlbumId == albums.AlbumId
INNER JOIN invoice_items ON invoice_items.TrackId == tracks.TrackId
GROUP BY artists.ArtistId
ORDER BY Revenue DESC 
LIMIT 1
''', conn)

          Name  Revenue
0  Iron Maiden    138.6